/*
  purge - удаляет со всеми настройками
  git clone - скачать репозиторий
  git status - показывает какие файлы он собирается закоммитить
  git add - добавить файлы в планируемый коммит
  git add * - добавление всех файлов
  git diff HEAD - посмотреть какие изменения внёс в коде
  q - для выхода из diff
  git log - можно просмотреть все свои изменения в коммитах
  git commit - записать изменения в историю
. git commit -m "сделал изменения "
  git config - показываем явно кто делает изменения
  git push - позволяет локальные изменения послать на сервер
 git pull - подтягивает все изменения коммитов с сервера
 git commit -am " "- это сокращение git add * и git commit m 
  SSH ( secure shell) позволяет выполнять удалённые линуксовые команды на другом компьютере
 */